[
    {
        "Question": "From which ancient astronomical work does the quote 'Moonlight is born from where the sun shines; the dark part of the moon is born from where the sun is blocked. When facing the sun, the light is full; when approaching the sun, the light is gone' come from?",
        "question_id": 229
    },
    {
        "Question": "From which classical text does the quote 'After thunder and rain in summer, the Lei and Ju rivers converge' come from?",
        "question_id": 230
    },
    {
        "Question": "From which text does the quote 'What one thinks during the day appears in dreams at night, where spirit and form meet' come from?",
        "question_id": 231
    },
    {
        "Question": "In 'Mencius', whose philosophy is described in the quote 'Would not pull a single hair even if it would benefit the whole world'?",
        "question_id": 232
    },
    {
        "Question": "What are the 'five elements' that Confucius said 'One who can practice these five things under heaven is benevolent'?",
        "question_id": 233
    },
    {
        "Question": "Which traditional festival's custom is described in the 'Book of Later Han' quote: 'Officials and common people all cleansed themselves in eastward-flowing water, called washing and purification, to remove old ailments and achieve great cleanliness'?",
        "question_id": 234
    },
    {
        "Question": "In the poem line 'The singing girls know not the pain of a fallen nation, Still singing 'The Song of the Back Garden' across the river', which dynasty does 'nation' refer to?",
        "question_id": 235
    },
    {
        "Question": "In the saying 'The King of Chu loved slender waists, many starved to death in the palace', whose waist does 'slender waist' refer to?",
        "question_id": 236
    },
    {
        "Question": "In the line 'Can Cong and Yu Fu, how vague was the founding of the state', who are 'Can Cong' and 'Yu Fu'?",
        "question_id": 237
    },
    {
        "Question": "'Records of Precious Foods' is one of China's ancient culinary works, written during the Northern and Southern Dynasties. Who is its author?",
        "question_id": 238
    },
    {
        "Question": "In Wang Shifu's 'Romance of the Western Chamber', he wrote: 'Tears of red sorrow soak the sleeves, wetter than Sima's blue robe', who does 'Sima's blue robe' refer to?",
        "question_id": 239
    },
    {
        "Question": "Which ancient text first recorded the story of Chang'e?",
        "question_id": 240
    },
    {
        "Question": "How are the surnames arranged in the familiar 'Hundred Family Surnames'?",
        "question_id": 241
    },
    {
        "Question": "What industry's methods are recorded in the Qin Dynasty's 'Fengzhen Shi'?",
        "question_id": 242
    },
    {
        "Question": "During the Tang Dynasty, what was referred to as one of the 'Three Absolutes' alongside Zhang Xu's cursive script and Pei Min's sword dance?",
        "question_id": 243
    },
    {
        "Question": "Which scene from 'Journey to the West' does the line 'The golden monkey fiercely wields his thousand-pound staff, clearing the jade firmament of ten thousand miles of dust' describe?",
        "question_id": 244
    },
    {
        "Question": "What industry's methods are recorded in the Qin Dynasty's 'Fengzhen Shi'?",
        "question_id": 245
    },
    {
        "Question": "Who was Zhou Yu's father?",
        "question_id": 246
    },
    {
        "Question": "Who said the quote 'I disapprove of what you say, but I will defend to the death your right to say it'?",
        "question_id": 247
    },
    {
        "Question": "What is the relationship between Gao Qiu and Su Shi?",
        "question_id": 248
    },
    {
        "Question": "Who are the 'Three Scholars of Yannan'?",
        "question_id": 249
    },
    {
        "Question": "What is the origin of the term 'Miss Qianjin' (thousand gold) and which historical figure is it related to?",
        "question_id": 250
    },
    {
        "Question": "Who is referred to as 'Banshan Jushi' (Half-Mountain Recluse)?",
        "question_id": 251
    },
    {
        "Question": "Who is known as both the 'Curtain-Rolling General' and the 'Golden-Bodied Arhat'?",
        "question_id": 252
    },
    {
        "Question": "Are Zhou Zhangshou and Zhou Shuren the same person?",
        "question_id": 253
    },
    {
        "Question": "Which town is praised as 'the most prosperous in Chu and the thoroughfare of nine provinces'?",
        "question_id": 254
    },
    {
        "Question": "Where is Tibet University for Nationalities located?",
        "question_id": 255
    },
    {
        "Question": "Which city has the abbreviation '皋' (Gao)?",
        "question_id": 256
    },
    {
        "Question": "Which mountain is famed as 'the famous mountain at sea, the supreme scenic wonder in the world' and also known as 'the First Mountain in Southeast China'?",
        "question_id": 257
    },
    {
        "Question": "What is the national anthem of Austria?",
        "question_id": 258
    },
    {
        "Question": "How many districts does Shanghai have?",
        "question_id": 259
    },
    {
        "Question": "Is there any connection between the name of Changzhou and Changshu?",
        "question_id": 260
    },
    {
        "Question": "Is the main campus of Hebei University of Technology located in Hebei?",
        "question_id": 261
    },
    {
        "Question": "Is Sichuan International Studies University located in Sichuan?",
        "question_id": 262
    },
    {
        "Question": "Is Sichuan Fine Arts Institute located in Sichuan?",
        "question_id": 263
    },
    {
        "Question": "Is North China University of Water Resources and Electric Power located in Hebei?",
        "question_id": 264
    },
    {
        "Question": "Which is the only city in China named after a flower?",
        "question_id": 265
    },
    {
        "Question": "Which district has the second largest area in Shanghai?",
        "question_id": 266
    },
    {
        "Question": "Which Chinese city is nicknamed 'Pearl City' (珠城)?",
        "question_id": 267
    },
    {
        "Question": "What is currently the tallest building in Asia?",
        "question_id": 268
    },
    {
        "Question": "Which city is known for being 'the throat of Huai River and the lips and teeth of Jiangnan', and also 'the chief prefecture of Jianghuai and a vital junction between Wu and Chu'?",
        "question_id": 269
    },
    {
        "Question": "Where is the largest county by administrative area in China?",
        "question_id": 270
    },
    {
        "Question": "Is Nanchang Road located in Nanchang?",
        "question_id": 271
    },
    {
        "Question": "According to the 'Travels of Xu Xiake', how many provinces in China did Xu Xiake travel through?",
        "question_id": 272
    },
    {
        "Question": "Which is the most populous ethnic minority group in China?",
        "question_id": 273
    },
    {
        "Question": "Which province is the fourth largest in China by area?",
        "question_id": 274
    },
    {
        "Question": "Is air quality better in the morning than in the afternoon?",
        "question_id": 275
    },
    {
        "Question": "What time is the national flag raised at Tiananmen Square every day?",
        "question_id": 276
    },
    {
        "Question": "What are the 'Five Vegetables' (五菜)?",
        "question_id": 277
    },
    {
        "Question": "Can brushing your teeth immediately after eating protect them?",
        "question_id": 278
    },
    {
        "Question": "Are cherry pits poisonous? Can eating them cause poisoning?",
        "question_id": 279
    },
    {
        "Question": "What does 'Afanti' mean in the Uyghur language in Xinjiang?",
        "question_id": 280
    },
    {
        "Question": "Which country is the brand Darlie toothpaste from?",
        "question_id": 281
    },
    {
        "Question": "When flying a flag at half-mast, where should the flag be lowered to?",
        "question_id": 282
    },
    {
        "Question": "What are the 'Three Matchmakers and Six Tokens'in traditional Chinese marriage?",
        "question_id": 283
    },
    {
        "Question": "What does 'chi shenghuo' mean in Shanghainese?",
        "question_id": 284
    },
    {
        "Question": "What are the 'Three Underworld Festivals'?",
        "question_id": 285
    },
    {
        "Question": "What is 'yue yat'?",
        "question_id": 286
    },
    {
        "Question": "What is the difference between 'guanggun' and 'guanggunr' in the Henan dialect?",
        "question_id": 287
    },
    {
        "Question": "Who is the author of the Chinese historical novel 'Sui Tang Yanyi'?",
        "question_id": 288
    },
    {
        "Question": "Why is a wealthy and powerful son-in-law called a 'golden turtle son-in-law'?",
        "question_id": 289
    },
    {
        "Question": "Can Maoshan Taoist priests eat meat and get married?",
        "question_id": 290
    },
    {
        "Question": "Is spiciness a taste sensation?",
        "question_id": 291
    },
    {
        "Question": "Who registered the trademark for 'Lanzhou Lamian' (Lanzhou Hand-Pulled Noodles)?",
        "question_id": 292
    },
    {
        "Question": "Mr. Wang recently changed his QQ status to 'celebrating the joy of receiving a jade tablet'. What joyful event might he be celebrating?",
        "question_id": 293
    },
    {
        "Question": "Which crop is referred to in the farming proverb: 'Early first Fu, late second Fu, topping during mid-Fu is best'?",
        "question_id": 294
    },
    {
        "Question": "What is the origin of the name '84 Disinfectant'?",
        "question_id": 295
    },
    {
        "Question": "Is walking more tiring than standing?",
        "question_id": 296
    },
    {
        "Question": "In Nanjing, which day is traditionally considered 'Little New Year'?",
        "question_id": 297
    },
    {
        "Question": "Which country owns the Zhonghua (Chinese) toothpaste brand?",
        "question_id": 298
    },
    {
        "Question": "Is Da Hong Pao a black tea?",
        "question_id": 299
    },
    {
        "Question": "The title of Zhang Yimou’s film 'Curse of the Golden Flower' comes from which classical poem?",
        "question_id": 300
    },
    {
        "Question": "What is the original name of Fu Ming, the protagonist in the sitcom 'I Love My Family'?",
        "question_id": 301
    },
    {
        "Question": "When is Bruce Lee Day?",
        "question_id": 302
    },
    {
        "Question": "Which movie features the line: 'Translate, translate—what is surprise?'",
        "question_id": 303
    },
    {
        "Question": "In the TV drama 'Empresses in the Palace', who plays the role of Concubine Li?",
        "question_id": 304
    },
    {
        "Question": "Who is the historical prototype for Zhen Huan in the drama 'Empresses in the Palace'?",
        "question_id": 305
    },
    {
        "Question": "What award did the film adaptation of 'Red Sorghum' win at the Berlin International Film Festival?",
        "question_id": 306
    },
    {
        "Question": "In the TV drama 'Empresses in the Palace', which emperor does Chen Jianbin portray?",
        "question_id": 307
    },
    {
        "Question": "Which Stephen Chow movie features the line: 'That guy looks strange... I saw him too... He looks like a dog'?",
        "question_id": 308
    },
    {
        "Question": "Who played the role of Xiaoming in the movie 'A Brighter Summer Day'?",
        "question_id": 309
    },
    {
        "Question": "Who directed the TV drama 'The Bronze Teeth' (also known as 'Iron Teeth Bronze Teeth Ji Xiaolan')?",
        "question_id": 310
    },
    {
        "Question": "In 1998, the film 'Titanic' won 11 Academy Awards. Before that, which other film also won 11 Oscars?",
        "question_id": 311
    },
    {
        "Question": "What was the first feature-length narrative film produced in China?",
        "question_id": 312
    },
    {
        "Question": "What is the origin and meaning of the idiom 'like sitting in a spring breeze'?",
        "question_id": 313
    },
    {
        "Question": "Who proposed the concept of the 'Three Bonds and Five Constants'?",
        "question_id": 314
    },
    {
        "Question": "What is the origin of the idiom 'eat next year's grain this year' (Yin chi mao liang)?",
        "question_id": 315
    },
    {
        "Question": "Where does the term 'servant ox for children' (ru zi niu) originate from?",
        "question_id": 316
    },
    {
        "Question": "What is the source of the idiom 'manipulate from above and below' (shang xia qi shou)?",
        "question_id": 317
    },
    {
        "Question": "The original form of the proverb 'No cheating, no business; no cruelty, no man' was 'No peak, no business; no measure, no man'. What do 'peak' and 'measure' mean here?",
        "question_id": 318
    },
    {
        "Question": "In the idiom 'plump like Huan, slender like Yan', who does 'Yan' refer to?",
        "question_id": 319
    },
    {
        "Question": "In the idiom 'six spirits without a master', what are the 'six spirits'?",
        "question_id": 320
    },
    {
        "Question": "Where does the idiom 'when the water recedes, the rocks appear' (shui luo shi chu) originate from?",
        "question_id": 321
    },
    {
        "Question": "What is the next line of the proverb 'All rivers run into the sea'?",
        "question_id": 322
    },
    {
        "Question": "What is the next line of the saying 'Iron rooster'?",
        "question_id": 323
    },
    {
        "Question": "Can genes only control traits through regulating enzyme synthesis?",
        "question_id": 324
    },
    {
        "Question": "Why does skin wrinkle after being soaked in water for a long time?",
        "question_id": 325
    },
    {
        "Question": "Is oxygen the most abundant element by dry weight in animal bodies?",
        "question_id": 326
    },
    {
        "Question": "When switching from a low to a high-power microscope lens, should the coarse focus knob be used?",
        "question_id": 327
    },
    {
        "Question": "Are proteins the controllers of life processes?",
        "question_id": 328
    },
    {
        "Question": "How long is a goldfish's memory span?",
        "question_id": 329
    },
    {
        "Question": "How old was Zhou Shuren when he first used the pen name 'Lu Xun' to write 'Diary of a Madman'?",
        "question_id": 330
    },
    {
        "Question": "Which celestial body's crater was named 'Wan Hu' by NASA, in honor of the first person in history said to have attempted spaceflight using rockets?",
        "question_id": 331
    },
    {
        "Question": "Which mathematical theorem is internationally recognized for using the word 'China' in its name?",
        "question_id": 332
    },
    {
        "Question": "Was the Pythagorean Theorem actually discovered by Pythagoras?",
        "question_id": 333
    },
    {
        "Question": "If two populations of the same species have different gene pools, will they definitely evolve into different species?",
        "question_id": 334
    },
    {
        "Question": "Who was the first to publish the method of least squares?",
        "question_id": 335
    },
    {
        "Question": "Who invented the first electric light bulb?",
        "question_id": 336
    },
    {
        "Question": "What happens if lightning strikes a bullet in mid-flight?",
        "question_id": 337
    },
    {
        "Question": "Can the equatorial plate be observed with a light microscope during cell division?",
        "question_id": 338
    },
    {
        "Question": "Can HIV completely destroy the body's immune system?",
        "question_id": 339
    },
    {
        "Question": "Do endocytosis and exocytosis demonstrate the selective permeability of the cell membrane?",
        "question_id": 340
    },
    {
        "Question": "Is L-carnitine the same as Vitamin BT?",
        "question_id": 341
    },
    {
        "Question": "Which is more active—the brain during sleep or while watching TV?",
        "question_id": 342
    },
    {
        "Question": "When does the human heartbeat begin for the first time?",
        "question_id": 343
    },
    {
        "Question": "Which animal has the widest field of view?",
        "question_id": 344
    },
    {
        "Question": "Do butterflies have tails?",
        "question_id": 345
    },
    {
        "Question": "Why is the Jianzhou cat in Sichuan also called the 'four-eared cat'?",
        "question_id": 346
    },
    {
        "Question": "Who created the mural paintings of the Mogao Caves in Dunhuang?",
        "question_id": 347
    },
    {
        "Question": "Whose portrait appears at the beginning of the book 'History of Forensic Medicine and Forensic Examination'?",
        "question_id": 348
    },
    {
        "Question": "Which craft is praised as 'clouds in the sky, flowers on the ground'?",
        "question_id": 349
    },
    {
        "Question": "Who was Guo Degang’s first storytelling (Pingshu) teacher?",
        "question_id": 350
    },
    {
        "Question": "Which calligrapher was known as the 'Drunken Monk'?",
        "question_id": 351
    },
    {
        "Question": "Which painter is described as 'honored across five dynasties, famed throughout the world'?",
        "question_id": 352
    },
    {
        "Question": "Who created the calligraphy style known as 'Slender Gold Script'?",
        "question_id": 353
    },
    {
        "Question": "Which Tang Dynasty painter is attributed with the work 'Court Ladies Wearing Flowered Headdresses'?",
        "question_id": 354
    },
    {
        "Question": "The ink work containing the line 'Bamboo shoots and tea are exceptionally fine. You may come directly. From Huai Su.' belongs to which batch of Chinese cultural relics prohibited from export?",
        "question_id": 355
    },
    {
        "Question": "Which form of Chinese opera is known as the 'master of all Chinese operas'?",
        "question_id": 356
    },
    {
        "Question": "The line 'Wumeng Mountains connect to mountains beyond' appears in which song by Phoenix Legend?",
        "question_id": 357
    },
    {
        "Question": "Which was the first Chinese band to perform at Woodstock Music Festival?",
        "question_id": 358
    },
    {
        "Question": "The lyrics 'Young lad arrives, oh, lotus and peony bloom in the moonlight...' come from which song?",
        "question_id": 359
    },
    {
        "Question": "The lyrics 'Birds in the sky fly toward the phoenix... Chairman Mao in Beijing, we will always follow you' are from which song?",
        "question_id": 360
    },
    {
        "Question": "The lyrics 'Row the boat to the lake’s heart... the lake reflects our shadows like twin water chestnuts' come from which song?",
        "question_id": 361
    }   
]